друг = input("Хочешь со мной дружить? ")

while друг not in ["да", "ок", "хорошо"]:
    print("Ну давай, соглашайся!")
    друг = input("Хочешь со мной дружить? ")

name = input("Как тебя зовут? ")

if name.lower() == "нуртилек":
    print("Ты крутой!")

age = int(input("Сколько тебе лет? "))

if age < 16:
    print("Да, ты младше меня")
elif age == 16:
    print("Да, ты мой ровесник")
elif age <= 30:
    print("Какой ты большой!")
else:
    print("педофил")

nationality = input("Какая у тебя национальность? ")

color = input("Какой цвет ты любишь? ")

узнать = input("Хочешь узнать обо мне? ")

while узнать not in ["да", "ок", "хорошо"]:
    узнать = input("Ну хочешь узнать обо мне? ")

print("Меня зовут Нуртилек. мне 16 лет я приехал из оша")
